/*Создай по одной переменной каждого примитивного целочисленного типа в классе.
Этим переменным присвой минимально возможное для них значение.
Никаких методов создавать не нужно.

        Требования:
        •	В классе должны быть созданы переменные всех примитивных целочисленного типов.
•	Всем целочисленным переменным должно быть присвоено минимально возможное для них значение.
•	В классе Solution не должно быть создано никаких методов.*/

package taskiFrom0021To0040;

public class Task0034 {
    byte num1 = -128;
    short num2 = -32768;
    int num3 = -2147483648;
    long num4 = -9223372036854775808L;
}
