/*Создай по одной переменной каждого примитивного целочисленного типа в классе.
Этим переменным присвой максимально возможное для них значение.
Никаких методов создавать не нужно.

        Требования:
        •	В классе должны быть созданы переменные всех примитивных целочисленных типов.
•	Всем целочисленным переменным должно быть присвоено максимально возможное для них значение.
•	В классе Solution не должно быть создано никаких методов.*/

package taskiFrom0021To0040;

public class Task0033 {
    byte num1 = 127;
    short num2 = 32767;
    int num3 = 2147483647;
    long num4 = 9223372036854775807L;
}
